УправлениеПаркомАттракционов/src/Catalogs/РассылкиОтчетов/РассылкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РассылкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЛичныеРассылки</name>
      <description>Личные рассылки</description>
    </items>
  </predefined>
  <attributes>
    <name>FTPКаталог</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPЛогин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPПассивноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FTPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архивировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПочтовогоАдресаПолучателей</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАрхива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьFTPРесурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПапку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСетевойКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭлектроннуюПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкиПисьмаВФорматеHTML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Личная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасписания</name>
    <type>
      <types>EnumRef.ПериодичностиРасписанийРассылокОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Персонализирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СетевойКаталогLinux</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СетевойКаталогWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрытыеКопии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаВФорматеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПолучателейРассылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоУведомить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранслитерироватьИменаФайлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВключатьДатуВИмяФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажностьПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВставлятьОтчетыВТекстПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьОтчетыВоВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьПаролиЗашифровать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отчеты</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьЕслиПустой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Настройки</name>
      <comment>ПользовательскиеНастройкиКомпоновкиДанных или ТаблицаЗначений</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонНаименования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФорматыОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>EnumRef.ФорматыСохраненияОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>DefinedType.ПолучательРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Catalogs/РассылкиОтчетов/Forms/ПовторнаяРассылкаОтчетов/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	РассылкаСсылка = Параметры.Ссылка;
	СостояниеРассылки = РассылкаОтчетов.ПолучитьСостояниеРассылкиОтчетов(РассылкаСсылка);
	
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Идентификатор = "ПовторнаяРассылка";
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	
	Если СостояниеРассылки.СОшибками Тогда
		ПараметрыВажногоСообщения.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рассылка отчетов (%1) была отправлена не всем получателям'"),
			СостояниеРассылки.ПоследнийЗапускНачало);
		ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Повторите рассылку.'");
		ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Рассылка отчетов была отправлена не всем получателям'");
	Иначе
		ПараметрыВажногоСообщения.ТипСообщения = "Информация";
		ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Повторная рассылка не требуется.'");
		ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Повторная рассылка не требуется'");
	КонецЕсли;
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
	ЗаполнитьПолучателейПовторнойРассылки(РассылкаСсылка, СостояниеРассылки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьРассылку(Команда)
	
	Если Получатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивРассылок = Новый Массив;
	МассивРассылок.Добавить(РассылкаСсылка);
	
	ПараметрыЗапуска = Новый Структура("МассивРассылок, Форма, ЭтоФормаЭлемента");
	ПараметрыЗапуска.МассивРассылок = МассивРассылок;
	ПараметрыЗапуска.Форма = ВладелецФормы;
	ПараметрыЗапуска.ЭтоФормаЭлемента = (ВладелецФормы = "Справочник.РассылкиОтчетов.Форма.ФормаЭлемента");
	
	СписокПолучателей = Новый Соответствие;
	Для Каждого СтрокаПолучатель Из Получатели Цикл
		СписокПолучателей.Вставить(СтрокаПолучатель.Получатель, СтрокаПолучатель.АдресЭлектроннойПочты);
	КонецЦикла;
	
	РассылкаОтчетовКлиент.ВыполнитьСейчасВФоне(СписокПолучателей, ПараметрыЗапуска);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПолучателейПовторнойРассылки(РассылкаСсылка, СостояниеРассылки)
	
	ПолучателиПовторнойРассылки = РассылкаОтчетов.ПолучателиПовторнойРассылкиОтчетов(РассылкаСсылка,
		СостояниеРассылки.ПоследнийЗапускНачало, СостояниеРассылки.НомерСеанса);
	
	Для Каждого Получатель Из ПолучателиПовторнойРассылки Цикл
		СтрокаПолучатели = Получатели.Добавить();
		СтрокаПолучатели.Получатель = Получатель.Ключ;
		СтрокаПолучатели.АдресЭлектроннойПочты = Получатель.Значение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
